maivananh111/STM32_RTOSSDK/peripherals/source/spi.cpp
/*
 * spi.cpp
 *
 *  Created on: Mar 13, 2023
 *      Author: anh
 */

#include "peripheral_config.h"
#if ENABLE_SPI

#include "periph/spi.h"
#include "periph/gpio.h"
#include "periph/systick.h"
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
#include "system/log.h"
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */


#if CONFIG_USE_LOG_MONITOR && SPI_LOG
static const char *TAG = "SPI";
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */


result_t cc;
result_t SPI_Tx_ISR(spi *spi);
result_t SPI_Rx_ISR(spi *spi);

void SPI_IRQHandler(spi *spi);

spi::spi(SPI_TypeDef *Spi){
	_spi = Spi;
}

result_t spi::init(spi_config_t *conf){
	result_t ret;
	_conf = conf;
#if ENABLE_DMA
	_txdma = _conf->txdma;
	_rxdma = _conf->rxdma;
#endif /* ENABLE_DMA */

#if defined(SPI1)
	if     (_spi == SPI1) RCC -> APB2ENR |= RCC_APB2ENR_SPI1EN;
#endif /* defined(SPI1) */
#if defined(SPI2)
	else if(_spi == SPI2) RCC -> APB1ENR |= RCC_APB1ENR_SPI2EN;
#endif /* defined(SPI2) */
#if defined(SPI3)
	else if(_spi == SPI3) RCC -> APB1ENR |= RCC_APB1ENR_SPI3EN;
#endif /* defined(SPI3) */
#if defined(SPI4)
	else if(_spi == SPI4) RCC -> APB2ENR |= RCC_APB2ENR_SPI4EN;
#endif /* defined(SPI4) */
#if defined(SPI5)
	else if(_spi == SPI5) RCC -> APB2ENR |= RCC_APB2ENR_SPI5EN;
#endif /* defined(SPI6) */
#if defined(SPI6)
	else if(_spi == SPI6) RCC -> APB2ENR |= RCC_APB2ENR_SPI6EN;
#endif /* defined(SPI4) */


#if defined(STM32F1)
	if(_conf->mode == SPI_FULLDUPLEX_MASTER || _conf->mode == SPI_HALFDUPLEX_MASTER){
		gpio_set_alternatefunction(_conf->clkport, _conf->clkpin, GPIO_ALTERNATE_PUSHPULL);
		gpio_set_alternatefunction(_conf->mosiport, _conf->mosipin, GPIO_ALTERNATE_PUSHPULL);
		if(_conf->mode == SPI_FULLDUPLEX_MASTER) gpio_set_mode(_conf->misoport, _conf->misopin, GPIO_INPUT);
		if(_conf->nss == SPI_HARDWARE_NSS){
			if(_conf->nss_dir == SPI_NSS_INPUT) gpio_set_mode(_conf->nssport, _conf->nsspin, GPIO_INPUT);
			else gpio_set_alternatefunction(_conf->nssport, _conf->nsspin, GPIO_ALTERNATE_PUSHPULL);
		}
	}
	else{
		gpio_set_alternatefunction(_conf->misoport, _conf->misopin, GPIO_ALTERNATE_PUSHPULL);
		gpio_set_mode(_conf->clkport, _conf->clkpin, GPIO_INPUT);
		if(_conf->mode == SPI_FULLDUPLEX_SLAVE) gpio_set_mode(_conf->mosiport, _conf->mosipin, GPIO_INPUT);
		if(_conf->nss == SPI_HARDWARE_NSS) gpio_set_mode(_conf->nssport, _conf->nsspin, GPIO_INPUT);
	}

#elif defined(STM32F4)
/* Configuration CLK Pin */
	gpio_port_clock_enable(_conf -> clkport);
#if defined(SPI4) && defined(SPI5) && defined(SPI6)
	gpio_set_alternatefunction(_conf -> clkport, _conf -> clkpin, AF5_SPI1_6);
#elif defined(SPI1) || defined(SPI2)
	if(_spi == SPI1 || _spi == SPI2){
		gpio_set_alternatefunction(_conf -> clkport, _conf -> clkpin, AF5_SPI1_2);
	}
	else{
		gpio_set_alternatefunction(_conf -> clkport, _conf -> clkpin, AF6_SPI3);
	}
	gpio_set_alternatefunction_type(_conf -> clkport, _conf -> clkpin, GPIO_OUTPUT_PUSHPULL);
#endif /* defined(SPI4) && defined(SPI5) defined(SPI6) */
	gpio_set_alternatefunction_type(_conf -> clkport, _conf -> clkpin, GPIO_OUTPUT_PUSHPULL);

/* Configuration MISO Pin */
	if(_conf -> mode & (SPI_FULLDUPLEX_MASTER | SPI_FULLDUPLEX_SLAVE | SPI_HALFDUPLEX_SLAVE)){
		gpio_port_clock_enable(_conf -> misoport);
#if defined(SPI4) && defined(SPI5) && defined(SPI6)
		gpio_set_alternatefunction(_conf -> misoport, _conf -> misopin, AF5_SPI1_6);
#elif defined(SPI1) || defined(SPI2)
		if(_spi == SPI1 || _spi == SPI2){
			gpio_set_alternatefunction(_conf -> misoport, _conf -> misopin, AF5_SPI1_2);
		}
		else{
			gpio_set_alternatefunction(_conf -> misoport, _conf -> misopin, AF6_SPI3);
		}
#endif /* defined(SPI4) && defined(SPI5) defined(SPI6) */
		gpio_set_alternatefunction_type(_conf -> misoport, _conf -> misopin, GPIO_OUTPUT_PUSHPULL);
	}

/* Configuration MOSI Pin */
	if(_conf -> mode & (SPI_FULLDUPLEX_MASTER | SPI_HALFDUPLEX_MASTER | SPI_FULLDUPLEX_SLAVE)){
		gpio_port_clock_enable(_conf -> mosiport);
#if defined(SPI4) && defined(SPI5) && defined(SPI6)
		gpio_set_alternatefunction(_conf -> mosiport, _conf -> mosipin, AF5_SPI1_6);
#elif defined(SPI1) || defined(SPI2)
		if(_spi == SPI1 || _spi == SPI2){
			gpio_set_alternatefunction(_conf -> mosiport, _conf -> mosipin, AF5_SPI1_2);
		}
		else{
			gpio_set_alternatefunction(_conf -> mosiport, _conf -> mosipin, AF6_SPI3);
		}
#endif /* defined(SPI4) && defined(SPI5) defined(SPI6) */
		gpio_set_alternatefunction_type(_conf -> mosiport, _conf -> mosipin, GPIO_OUTPUT_PUSHPULL);
	}

/* Configuration NSS Pin */
	if(_conf -> nss == SPI_HARDWARE_NSS){
		gpio_port_clock_enable(_conf -> nssport);
#if defined(SPI4) && defined(SPI5) && defined(SPI6)
		gpio_set_alternatefunction(_conf -> nssport, _conf -> nsspin, AF5_SPI1_6);
#elif defined(SPI1) || defined(SPI2)
		if(_spi == SPI1 || _spi == SPI2){
			gpio_set_alternatefunction(_conf -> nssport, _conf -> nsspin, AF5_SPI1_2);
		}
		else{
			gpio_set_alternatefunction(_conf -> nssport, _conf -> nsspin, AF6_SPI3);
		}
#endif /* defined(SPI4) && defined(SPI5) defined(SPI6) */
		gpio_set_alternatefunction_type(_conf -> nssport, _conf -> nsspin, GPIO_OUTPUT_PUSHPULL);
	}
#endif /* STM32F4 */

	_spi -> CR1 = 0x00U;

	_spi -> CR1 |= (_conf->clocksample << SPI_CR1_CPHA_Pos) | (_conf->clockdivision << SPI_CR1_BR_Pos);
	_spi -> CR1 |= (_conf->datasize << SPI_CR1_DFF_Pos) | (_conf->bitordering << SPI_CR1_LSBFIRST_Pos);
	if(_conf -> mode & (SPI_FULLDUPLEX_MASTER | SPI_HALFDUPLEX_MASTER)) _spi -> CR1 |= SPI_CR1_MSTR | SPI_CR1_SSI;
	if(_conf -> mode & (SPI_HALFDUPLEX_MASTER | SPI_HALFDUPLEX_SLAVE)) _spi -> CR1 |= SPI_CR1_BIDIMODE;
	if(_conf -> nss == SPI_SOFTWARE_NSS) _spi -> CR1 |= SPI_CR1_SSM;

	_spi -> CR2 = 0x00U;
	if((_conf -> mode & (SPI_FULLDUPLEX_MASTER | SPI_HALFDUPLEX_MASTER)) && (_conf -> nss == SPI_HARDWARE_NSS)) _spi -> CR2 |= SPI_CR2_SSOE;

	if(_conf->control & (SPI_INTERRUPT_CONTROL | SPI_INTERRUPT_DMA_CONTROL)){
#if defined(SPI1)
		if     (_spi == SPI1) IRQn = SPI1_IRQn;
#endif /* defined(SPI1) */
#if defined(SPI2)
		else if(_spi == SPI2) IRQn = SPI2_IRQn;
#endif /* defined(SPI2) */
#if defined(SPI3)
		else if(_spi == SPI3) IRQn = SPI3_IRQn;
#endif /* defined(SPI3) */
#if defined(SPI4)
		else if(_spi == SPI4) IRQn = SPI4_IRQn;
#endif /* defined(SPI4) */
#if defined(SPI5)
		else if(_spi == SPI5) IRQn = SPI5_IRQn;
#endif /* defined(SPI6) */
#if defined(SPI6)
		else if(_spi == SPI6) IRQn = SPI6_IRQn;
#endif /* defined(SPI4) */

		if(_conf -> interruptpriority < CONFIG_RTOS_MAX_SYSTEM_INTERRUPT_PRIORITY){
			set_return(&ret, E_FAIL, __LINE__);
#if CONFIG_USE_LOG_MONITOR && EXTI_LOG
			LOG_ERROR(TAG, "%s -> %s -> Invalid priority, please increase the priority value.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && EXTI_LOG */
#if CONFIG_FAIL_CHIP_RESET
#if CONFIG_USE_LOG_MONITOR && EXTI_LOG
			LOG_INFO(TAG, "Chip will reset after %ds.", CONFIG_WAIT_FOR_RESET_TIME);
#endif /* CONFIG_USE_LOG_MONITOR && EXTI_LOG */
			systick_delay_ms(CONFIG_WAIT_FOR_RESET_TIME*1000U);
			__NVIC_SystemReset();
#endif /* CONFIG_FAIL_CHIP_RESET */
			return ret;
		}
		__NVIC_SetPriority(IRQn, _conf -> interruptpriority);
	}

	return ret;
}

result_t spi::deinit(void){
#if ENABLE_DMA
	_txdma = NULL;
	_rxdma = NULL;
#endif /* ENABLE_DMA */
	gpio_deinit(_conf -> clkport, _conf -> clkpin);
	if(_conf -> mode & (SPI_FULLDUPLEX_MASTER | SPI_FULLDUPLEX_SLAVE | SPI_HALFDUPLEX_SLAVE))
		gpio_deinit(_conf -> misoport, _conf -> misopin);
	if(_conf -> mode & (SPI_FULLDUPLEX_MASTER | SPI_HALFDUPLEX_MASTER | SPI_FULLDUPLEX_SLAVE))
		gpio_deinit(_conf -> mosiport, _conf -> mosipin);
	if(_conf -> nss == SPI_HARDWARE_NSS)
		gpio_deinit(_conf -> nssport, _conf -> nsspin);

#if defined(SPI1)
	if     (_spi == SPI1) RCC -> APB2ENR &=~ RCC_APB2ENR_SPI1EN;
#endif /* defined(SPI1) */
#if defined(SPI2)
	else if(_spi == SPI2) RCC -> APB1ENR &=~ RCC_APB1ENR_SPI2EN;
#endif /* defined(SPI2) */
#if defined(SPI3)
	else if(_spi == SPI3) RCC -> APB1ENR &=~ RCC_APB1ENR_SPI3EN;
#endif /* defined(SPI3) */
#if defined(SPI4)
	else if(_spi == SPI4) RCC -> APB2ENR &=~ RCC_APB2ENR_SPI4EN;
#endif /* defined(SPI4) */
#if defined(SPI5)
	else if(_spi == SPI5) RCC -> APB2ENR &=~ RCC_APB2ENR_SPI5EN;
#endif /* defined(SPI6) */
#if defined(SPI4)
	else if(_spi == SPI6) RCC -> APB2ENR &=~ RCC_APB2ENR_SPI6EN;
#endif /* defined(SPI4) */

	_spi -> CR1 = 0x00U;
	_spi -> CR2 = 0x00U;
	__IO uint32_t tmp = _spi -> DR;
	tmp = _spi -> SR;
	(void)tmp;

