maivananh111/STM32_RTOSSDK/peripherals/source/spi.cpp
	if(_conf -> control && (SPI_INTERRUPT_CONTROL | SPI_INTERRUPT_DMA_CONTROL)){
		__NVIC_ClearPendingIRQ(IRQn);
		__NVIC_DisableIRQ(IRQn);
	}

	return {E_OKE, 0};
}

result_t spi::register_event_handler(void (*function_ptr)(spi_event_t event, void *param), void *param){
	result_t ret;
	if(_conf -> control && (SPI_INTERRUPT_CONTROL | SPI_INTERRUPT_DMA_CONTROL)) {
		handler_callback = function_ptr;
		parameter = param;

		return ret;
	}
	else{
		set_return(&ret, E_UNSUPPORTED, __LINE__);
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
		LOG_WARN(TAG, "%s -> %s, Peripheral control unsupported register event handler.", __FILE__, __FUNCTION__ );
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */
	}

	return ret;
}

spi_config_t *spi::get_config(void){
	return _conf;
}

result_t spi::transmit(uint32_t data, uint32_t size){
	result_t ret;

	txcount = 0U;
	txlen = size;
	txbuf = data;

	if(_conf -> mode & SPI_HALFDUPLEX_SLAVE){
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
		LOG_ERROR(TAG, "%s -> %s -> Mode half duplex slave unsupported transmit function.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */
		set_return(&ret, E_UNSUPPORTED, __LINE__);
		return ret;
	}

	if(_conf -> mode & (SPI_HALFDUPLEX_MASTER | SPI_HALFDUPLEX_SLAVE)){
		_spi -> CR1 &=~ SPI_CR1_SPE;
		_spi -> CR1 |= SPI_CR1_BIDIOE;
	}

	if(!(_spi -> CR1 & SPI_CR1_SPE)) _spi -> CR1 |= SPI_CR1_SPE;

	while(txcount < txlen){
		ret = wait_flag_in_register_timeout(&(_spi -> SR), SPI_SR_TXE, FLAG_SET, SPI_TIMEOUT);
		if(!err_is_oke(&ret)) {
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
			LOG_ERROR(TAG, "%s -> %s -> Wait flag timeout.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */
			set_return_line(&ret, __LINE__);
			return ret;
		}

		_spi -> DR = *(uint32_t *)(txbuf);

		if(_conf->datasize == SPI_DATASIZE_8BIT) 		txbuf += sizeof(uint8_t);
		else if(_conf->datasize == SPI_DATASIZE_16BIT)  txbuf += sizeof(uint16_t);

		txcount++;
	}

	ret = wait_flag_in_register_timeout(&(_spi -> SR), SPI_SR_BSY, FLAG_RESET, SPI_TIMEOUT);
	if(!err_is_oke(&ret)) {
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
		LOG_ERROR(TAG, "%s -> %s -> Wait flag timeout.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */
		set_return_line(&ret, __LINE__);
		return ret;
	}

	if(!(_conf->mode & (SPI_HALFDUPLEX_MASTER | SPI_HALFDUPLEX_SLAVE))){
		__IO uint32_t tmp = _spi -> DR;
		tmp = _spi -> SR;
		(void)tmp;
	}

	return ret;
}

result_t spi::receive(uint32_t data, uint32_t size){
	result_t ret;

	rxcount = 0;
	rxlen = size;
	rxbuf = data;

	if(_conf->mode == SPI_HALFDUPLEX_MASTER) {
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
		LOG_ERROR(TAG, "%s -> %s -> Mode half duplex master unsupported receive function.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */
		set_return(&ret, E_UNSUPPORTED, __LINE__);
		return ret;
	}

	if(_conf -> mode & (SPI_HALFDUPLEX_MASTER | SPI_HALFDUPLEX_SLAVE)){
		_spi -> CR1 &=~ SPI_CR1_SPE;
		_spi -> CR1 |= SPI_CR1_BIDIOE;
	}

	if(!(_spi -> CR1 & SPI_CR1_SPE)) _spi -> CR1 |= SPI_CR1_SPE;

	while(rxcount < rxlen){
		if(_conf -> mode & SPI_FULLDUPLEX_MASTER){
			ret = wait_flag_in_register_timeout(&(_spi -> SR), SPI_SR_TXE, FLAG_SET, SPI_TIMEOUT);
			if(!err_is_oke(&ret)) {
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
				LOG_ERROR(TAG, "%s -> %s -> Wait flag timeout.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */
				set_return_line(&ret, __LINE__);
				return ret;
			}
			_spi -> DR = 0x00UL;
		}

		ret = wait_flag_in_register_timeout(&(_spi -> SR), SPI_SR_RXNE, FLAG_SET, SPI_TIMEOUT);
		if(!err_is_oke(&ret)) {
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
			LOG_ERROR(TAG, "%s -> %s -> Wait flag timeout.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */
			set_return_line(&ret, __LINE__);
			return ret;
		}
		*(uint32_t *)rxbuf = _spi -> DR;

		if(_conf->datasize == SPI_DATASIZE_8BIT) rxbuf += sizeof(uint8_t);
		else if(_conf->datasize == SPI_DATASIZE_16BIT) rxbuf += sizeof(uint16_t);

		rxcount++;
	}

	ret = wait_flag_in_register_timeout(&(_spi -> SR), SPI_SR_BSY, FLAG_RESET, SPI_TIMEOUT);
	if(!err_is_oke(&ret)) {
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
		LOG_ERROR(TAG, "%s -> %s -> Wait flag timeout.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */
		set_return_line(&ret, __LINE__);
		return ret;
	}
	if(!(_conf->mode & (SPI_HALFDUPLEX_MASTER | SPI_HALFDUPLEX_SLAVE))){
		__IO uint32_t tmp = _spi -> DR;
		tmp = _spi -> SR;
		(void)tmp;
	}

	return ret;
}

result_t spi::transmit_receive(uint32_t txdata, uint32_t rxdata, uint32_t size){
	result_t ret;

	txcount = 0U;
	rxcount = 0U;
	rxlen = size;
	txlen = size;
	txbuf = txdata;
	rxbuf = rxdata;

	if(_conf->mode & (SPI_HALFDUPLEX_MASTER | SPI_HALFDUPLEX_SLAVE)) {
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
			LOG_ERROR(TAG, "%s -> %s -> Mode half duplex master/slave unsupported transmit and receive function.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */
		set_return(&ret, E_UNSUPPORTED, __LINE__);
		return ret;
	}

	if(!(_spi -> CR1 & SPI_CR1_SPE)) _spi -> CR1 |= SPI_CR1_SPE;

	while(txcount < txlen){
		ret = wait_flag_in_register_timeout(&(_spi -> SR), SPI_SR_TXE, FLAG_SET, SPI_TIMEOUT);
		if(!err_is_oke(&ret)) {
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
			LOG_ERROR(TAG, "%s -> %s -> Wait flag timeout.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */
			set_return_line(&ret, __LINE__);
			return ret;
		}
		_spi -> DR = *(uint32_t *)txbuf;

		ret = wait_flag_in_register_timeout(&(_spi -> SR), SPI_SR_RXNE, FLAG_SET, SPI_TIMEOUT);
		if(!err_is_oke(&ret)) {
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
			LOG_ERROR(TAG, "%s -> %s -> Wait flag timeout.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */
			set_return_line(&ret, __LINE__);
			return ret;
		}
		*(uint32_t *)rxbuf = _spi -> DR;

		if(_conf->datasize == SPI_DATASIZE_8BIT) {
			txbuf += sizeof(uint8_t);
			rxbuf += sizeof(uint8_t);
		}
		else if(_conf->datasize == SPI_DATASIZE_16BIT) {
			txbuf += sizeof(uint16_t);
			rxbuf += sizeof(uint16_t);
		}

