maivananh111/STM32_RTOSSDK/peripherals/source/spi.cpp
		txcount++;
		rxcount++;
	}

	ret = wait_flag_in_register_timeout(&(_spi -> SR), SPI_SR_BSY, FLAG_RESET, SPI_TIMEOUT);
	if(!err_is_oke(&ret)) {
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
		LOG_ERROR(TAG, "%s -> %s -> Wait flag timeout.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */
		set_return_line(&ret, __LINE__);
		return ret;
	}
	if(!(_conf->mode & (SPI_HALFDUPLEX_MASTER | SPI_HALFDUPLEX_SLAVE))){
		__IO uint32_t tmp = _spi -> DR;
		tmp = _spi -> SR;
		(void)tmp;
	}

	return ret;
}


result_t spi::transmit_start_it(uint32_t data, uint32_t size){
	result_t ret;

	txcount = 0U;
	txlen = size;
	txbuf = data;

	if(_conf -> mode & SPI_HALFDUPLEX_SLAVE){
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
		LOG_ERROR(TAG, "%s -> %s -> Mode half duplex slave unsupported transmit function.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */
		set_return(&ret, E_UNSUPPORTED, __LINE__);
		return ret;
	}

	if(_conf -> mode & (SPI_HALFDUPLEX_MASTER | SPI_HALFDUPLEX_SLAVE)){
		_spi -> CR1 &=~ SPI_CR1_SPE;
		_spi -> CR1 |= SPI_CR1_BIDIOE;
	}

	_spi -> CR2 |= SPI_CR2_TXEIE | SPI_CR2_ERRIE;

	if(!(_spi -> CR1 & SPI_CR1_SPE)) _spi -> CR1 |= SPI_CR1_SPE;

	return ret;
}

result_t spi::receive_start_it(uint32_t data, uint32_t size){
	result_t ret;

	rxcount = 0U;
	rxlen = size;
	rxbuf = data;

	if(_conf -> mode == SPI_FULLDUPLEX_MASTER){
		return transmit_receive_start_it(rxbuf, rxbuf, rxlen);
	}

	if(_conf -> mode & SPI_HALFDUPLEX_MASTER){
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
		LOG_ERROR(TAG, "%s -> %s -> Mode half duplex master unsupported receive function.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */
		set_return(&ret, E_UNSUPPORTED, __LINE__);
		return ret;
	}

	if(_conf -> mode & (SPI_HALFDUPLEX_MASTER | SPI_HALFDUPLEX_SLAVE)){
		_spi -> CR1 &=~ SPI_CR1_SPE;
		_spi -> CR1 |= SPI_CR1_BIDIOE;
	}

	_spi -> CR2 |= SPI_CR2_RXNEIE | SPI_CR2_ERRIE;

	if((_spi -> CR1 & SPI_CR1_SPE) != SPI_CR1_SPE) _spi -> CR1 |= SPI_CR1_SPE;

	return ret;
}

result_t spi::transmit_receive_start_it(uint32_t txdata, uint32_t rxdata, uint32_t size){
	result_t ret;

	txcount = 0U;
	rxcount = 0U;
	rxlen = size;
	txlen = size;
	txbuf = txdata;
	rxbuf = rxdata;

	if(_conf -> mode & (SPI_HALFDUPLEX_MASTER | SPI_HALFDUPLEX_SLAVE)){
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
		LOG_ERROR(TAG, "%s -> %s -> Mode half duplex master/slave unsupported transmit function.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */
		set_return(&ret, E_UNSUPPORTED, __LINE__);
		return ret;
	}

	_spi -> CR2 |= SPI_CR2_RXNEIE | SPI_CR2_TXEIE | SPI_CR2_ERRIE;

	if((_spi -> CR1 & SPI_CR1_SPE) != SPI_CR1_SPE) _spi -> CR1 |= SPI_CR1_SPE;

	return ret;
}


#if ENABLE_DMA
result_t spi::transmit_start_dma(uint32_t data, uint32_t size){
	result_t ret;
	txcount = 0U;
	txlen = size;
	txbuf = data;

	if((_conf->mode & SPI_HALFDUPLEX_SLAVE) || (_txdma == NULL)){
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
		LOG_ERROR(TAG, "%s -> %s -> Mode half duplex slave unsupported transmit function or not selected dma.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */
		set_return(&ret, E_UNSUPPORTED, __LINE__);
		return ret;
	}

	dma_config_t *_dma_conf = _txdma -> get_config();
	if((uint8_t)_dma_conf -> datasize != (uint8_t)_conf -> datasize){
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
		LOG_ERROR(TAG, "%s -> %s -> Data size not match with dma.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */
		set_return(&ret, E_FAIL, __LINE__);
		return ret;
	}

	_spi -> CR1 &=~ SPI_CR1_SPE;
	if(_conf -> mode == SPI_HALFDUPLEX_MASTER) _spi -> CR1 |= SPI_CR1_BIDIOE;

	_spi -> CR2 &=~ SPI_CR2_TXDMAEN;

	ret = _txdma -> start(txbuf, (uint32_t) &(_spi -> DR), txlen);
	if(!err_is_oke(&ret)) {
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
		LOG_ERROR(TAG, "%s -> %s -> Transmit dma start fail.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */
		set_return_line(&ret, __LINE__);
		return ret;
	}

	_spi -> CR1 |= SPI_CR1_SPE;
	_spi -> CR2 |= SPI_CR2_ERRIE;
	_spi -> CR2 |= SPI_CR2_TXDMAEN;

	return ret;
}

result_t spi::receive_start_dma(uint32_t data, uint32_t size){
	result_t ret;

	txcount = 0U;
	txlen = size;
	txbuf = data;
	rxcount = 0U;
	rxlen = size;
	rxbuf = data;


	if((_conf->mode & SPI_HALFDUPLEX_MASTER) || (_rxdma == NULL)){
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
		LOG_ERROR(TAG, "%s -> %s -> Mode half duplex master unsupported receive function or not selected dma.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */
		set_return(&ret, E_UNSUPPORTED, __LINE__);
		return ret;
	}

	if(_conf -> mode & (SPI_FULLDUPLEX_MASTER)){
		return transmit_receive_start_dma(txbuf, rxbuf, rxlen);
	}

	dma_config_t *_dma_conf = _txdma -> get_config();
	if((uint8_t)_dma_conf -> datasize != (uint8_t)_conf -> datasize){
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
		LOG_ERROR(TAG, "%s -> %s -> Data size not match with dma.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */
		set_return(&ret, E_FAIL, __LINE__);
		return ret;
	}

	_spi -> CR1 &=~ SPI_CR1_SPE;
	_spi -> CR2 &=~ SPI_CR2_RXDMAEN;

	ret = _rxdma -> start((uint32_t) &(_spi -> DR), rxbuf, rxlen);
	if(!err_is_oke(&ret)) {
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
		LOG_ERROR(TAG, "%s -> %s -> Receive dma start fail.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */
		set_return_line(&ret, __LINE__);
		return ret;
	}

	_spi -> CR1 |= SPI_CR1_SPE;
	_spi -> CR2 |= SPI_CR2_ERRIE;
	_spi -> CR2 |= SPI_CR2_RXDMAEN;

	return ret;
}

result_t spi::transmit_receive_start_dma(uint32_t txdata, uint32_t rxdata, uint32_t size){
	result_t ret;

	txcount = 0U;
	txlen = size;
	txbuf = txdata;
	rxcount = 0U;
	rxlen = size;
	rxbuf = rxdata;

	if((_conf->mode & (SPI_HALFDUPLEX_MASTER | SPI_HALFDUPLEX_SLAVE)) || (_rxdma == NULL || _rxdma == NULL)){
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
		LOG_ERROR(TAG, "%s -> %s -> Mode half duplex master/slave unsupported receive function or not selected dma.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */
		set_return(&ret, E_UNSUPPORTED, __LINE__);
		return ret;
	}

