maivananh111/STM32_RTOSSDK/peripherals/source/spi.cpp
	dma_config_t *_txdma_conf = _txdma -> get_config();
	dma_config_t *_rxdma_conf = _rxdma -> get_config();
	if(((uint8_t)_txdma_conf -> datasize != (uint8_t)_conf -> datasize) || ((uint8_t)_rxdma_conf -> datasize != (uint8_t)_conf -> datasize)){
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
		LOG_ERROR(TAG, "%s -> %s -> Data size not match with dma.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */
		set_return(&ret, E_FAIL, __LINE__);
		return ret;
	}

	_spi -> CR1 &=~ SPI_CR1_SPE;
	_spi -> CR2 &=~ (SPI_CR2_RXDMAEN | SPI_CR2_TXDMAEN);

	ret = _rxdma -> start((uint32_t) &(_spi -> DR), (uint32_t)rxbuf, rxlen);
	if(!err_is_oke(&ret)) {
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
		LOG_ERROR(TAG, "%s -> %s -> Receive dma start fail.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */
		set_return_line(&ret, __LINE__);
		return ret;
	}


	ret = _txdma -> start((uint32_t)txbuf, (uint32_t) &(_spi -> DR), txlen);
	if(!err_is_oke(&ret)) {
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
		LOG_ERROR(TAG, "%s -> %s -> Transmit dma start fail.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */
		set_return_line(&ret, __LINE__);
		return ret;
	}

	_spi -> CR1 |= SPI_CR1_SPE;
	_spi -> CR2 |= SPI_CR2_ERRIE;
	_spi -> CR2 |= SPI_CR2_TXDMAEN | SPI_CR2_RXDMAEN;

	return ret;
}

result_t spi::transmit_stop_dma(void){
	result_t ret;

	txcount = 0U;
	txlen = 0U;
	txbuf = 0U;

	if(_spi -> CR2 & SPI_CR2_TXDMAEN) {
		ret = _txdma -> stop();
		if(!err_is_oke(&ret)) {
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
			LOG_ERROR(TAG, "%s -> %s -> Transmit dma stop fail.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */
			set_return_line(&ret, __LINE__);
			return ret;
		}
		_spi -> CR2 &=~ SPI_CR2_TXDMAEN;
		_spi -> CR1 &=~ SPI_CR1_SPE;
	}
	else{
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
		LOG_ERROR(TAG, "%s -> %s -> Transmit dma not started, can't stop.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */
	}

	return ret;
}

result_t spi::receive_stop_dma(void){
	result_t ret;

	rxcount = 0U;
	rxlen = 0U;
	rxbuf = 0U;

	if(_spi -> CR2 & SPI_CR2_RXDMAEN) {
		ret = _rxdma -> stop();
		if(!err_is_oke(&ret)) {
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
			LOG_ERROR(TAG, "%s -> %s -> Receive dma stop fail.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */
			set_return_line(&ret, __LINE__);
			return ret;
		}
		_spi -> CR2 &=~ SPI_CR2_RXDMAEN;
		_spi -> CR1 &=~ SPI_CR1_SPE;
	}
	else{
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
		LOG_ERROR(TAG, "%s -> %s -> Receive dma not started, can't stop.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */
	}

	return ret;
}

result_t spi::transmit_receive_stop_dma(void){
	result_t ret;

	txcount = 0U;
	txlen = 0U;
	txbuf = 0U;
	rxcount = 0U;
	rxlen = 0U;
	rxbuf = 0U;

	if(_spi -> CR2 & SPI_CR2_RXDMAEN) {
		ret = _rxdma -> stop();
		if(!err_is_oke(&ret)) {
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
			LOG_ERROR(TAG, "%s -> %s -> Receive dma stop fail.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */
			set_return_line(&ret, __LINE__);
			return ret;
		}
	}

	if(_spi -> CR2 & SPI_CR2_TXDMAEN) {
		ret = _txdma -> stop();
		if(!err_is_oke(&ret)) {
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
			LOG_ERROR(TAG, "%s -> %s -> Transmit dma stop fail.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */
			set_return_line(&ret, __LINE__);
			return ret;
		}
	}

	_spi -> CR2 &=~ (SPI_CR2_RXDMAEN | SPI_CR2_TXDMAEN);
	_spi -> CR1 &=~ SPI_CR1_SPE;

	return ret;
}
#endif /* ENABLE_DMA */



result_t SPI_Tx_ISR(spi *spi){
	result_t ret;

	spi -> _spi -> DR = *(uint32_t *)(spi -> txbuf);
	spi -> txcount++;

	if(spi -> _conf -> datasize ==  SPI_DATASIZE_8BIT)
		spi -> txbuf += sizeof(uint8_t);
	else if(spi -> _conf -> datasize ==  SPI_DATASIZE_16BIT)
		spi -> txbuf += sizeof(uint16_t);

	if(spi -> txcount == spi -> txlen){
		result_t ret = wait_flag_in_register_timeout(&(spi->_spi->SR), SPI_SR_TXE, FLAG_SET, SPI_TIMEOUT);
		if(!err_is_oke(&ret)) {
			set_return_line(&ret, __LINE__);
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
			LOG_ERROR(TAG, "%s -> %s -> Wait flag timeout.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */
			return ret;
		}

		spi -> _spi -> CR2 &=~ (SPI_CR2_TXEIE | SPI_CR2_ERRIE);

		ret = wait_flag_in_register_timeout(&(spi->_spi-> SR), SPI_SR_BSY, FLAG_RESET, SPI_TIMEOUT);
		if(spi -> _conf -> mode & (SPI_FULLDUPLEX_MASTER | SPI_HALFDUPLEX_MASTER)){
			if(!err_is_oke(&ret)) {
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
				LOG_ERROR(TAG, "%s -> %s -> Wait flag timeout.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */
				set_return_line(&ret, __LINE__);

				spi -> _spi -> CR2 &=~ (SPI_CR2_TXEIE | SPI_SR_RXNE | SPI_CR2_ERRIE);
				if(spi -> _conf -> mode & (SPI_HALFDUPLEX_MASTER)) spi -> _spi -> CR1 &=~ SPI_CR1_SPE;

				return ret;
			}
		}

		if(!(spi->_conf->mode & (SPI_HALFDUPLEX_MASTER | SPI_HALFDUPLEX_SLAVE))){
			__IO uint32_t tmp = spi -> _spi -> DR;
			tmp = spi -> _spi -> SR;
			(void)tmp;
		}
	}

	return ret;
}

result_t SPI_Rx_ISR(spi *spi){
	result_t ret;

	*(uint32_t *)(spi -> rxbuf) = spi -> _spi -> DR ;
	spi -> rxcount++;
	if(spi -> _conf -> datasize ==  SPI_DATASIZE_8BIT)
		spi -> rxbuf += sizeof(uint8_t);
	else if(spi -> _conf -> datasize ==  SPI_DATASIZE_16BIT)
		spi -> rxbuf += sizeof(uint16_t);

	if(spi -> rxcount == spi -> rxlen){
		spi -> _spi -> CR2 &=~ (SPI_CR2_RXNEIE | SPI_CR2_ERRIE);

		result_t ret = wait_flag_in_register_timeout(&(spi->_spi->SR), SPI_SR_RXNE, FLAG_RESET, SPI_TIMEOUT);
		if(!err_is_oke(&ret)) {
#if CONFIG_USE_LOG_MONITOR && SPI_LOG
			LOG_ERROR(TAG, "%s -> %s -> Wait flag timeout.", __FILE__, __FUNCTION__);
#endif /* CONFIG_USE_LOG_MONITOR && SPI_LOG */
			set_return_line(&ret, __LINE__);
			return ret;
		}

		if(!(spi->_conf->mode & (SPI_HALFDUPLEX_MASTER | SPI_HALFDUPLEX_SLAVE))){
			__IO uint32_t tmp = spi -> _spi -> DR;
			tmp = spi -> _spi -> SR;
			(void)tmp;
		}
	}

	return ret;
}

void SPI_IRQHandler(spi *spi){
	spi_event_t event = SPI_EVENT_NOEVENT;
	__IO uint32_t cr2_reg = spi -> _spi -> CR2;
	__IO uint32_t sr_reg  = spi -> _spi -> SR;

	if((cr2_reg & SPI_CR2_TXEIE) && (sr_reg & SPI_SR_TXE)){
		result_t ret = SPI_Tx_ISR(spi);
		if(!err_is_oke(&ret)){
			event = SPI_EVENT_ERROR;
			goto EventCB;
		}
		event = SPI_EVENT_TRANSMIT_COMPLETE;
		goto EventCB;
	}
	if((cr2_reg & SPI_CR2_RXNEIE) && (sr_reg & SPI_SR_RXNE)){
		result_t ret = SPI_Rx_ISR(spi);
		if(!err_is_oke(&ret)){
			event = SPI_EVENT_ERROR;
			goto EventCB;
		}
		event = SPI_EVENT_RECEIVE_COMPLETE;
		goto EventCB;
	}
	if((sr_reg & SPI_SR_OVR)
#if defined(STM32F4)
			|| (sr_reg & SPI_SR_FRE)
#endif /* STM32F4 */
	){
		event = SPI_EVENT_ERROR;
		__IO uint32_t tmp = spi -> _spi -> DR;
		tmp = spi -> _spi -> SR;
		(void)tmp;
		goto EventCB;
	}


	EventCB:
	if(spi -> handler_callback != NULL) spi -> handler_callback(event, spi -> parameter);
}


#if defined(SPI1)
spi spi_1(SPI1);
spi_t spi1 = &spi_1;
void SPI1_IRQHandler(void){
	SPI_IRQHandler(&spi_1);
}
#endif /* defined(SPI1) */
#if defined(SPI2)
spi spi_2(SPI2);
spi_t spi2 = &spi_2;
void SPI2_IRQHandler(void){
	SPI_IRQHandler(&spi_2);
}
#endif /* defined(SPI2) */
#if defined(SPI3)
spi spi_3(SPI3);
spi_t spi3 = &spi_3;
void SPI3_IRQHandler(void){
	SPI_IRQHandler(&spi_3);
}
#endif /* defined(SPI3) */
#if defined(SPI4)
spi spi_4(SPI4);
spi_t spi4 = &spi_4;
void SPI4_IRQHandler(void){
	SPI_IRQHandler(&spi_4);
}
#endif /* defined(SPI4) */
#if defined(SPI5)
spi spi_5(SPI5);
spi_t spi5 = &spi_5;
void SPI5_IRQHandler(void){
	SPI_IRQHandler(&spi_5);
}
#endif /* defined(SPI5) */
#if defined(SPI6)
spi spi_6(SPI6);
spi_t spi6 = &spi_6;
void SPI6_IRQHandler(void){
	SPI_IRQHandler(&spi_6);
}
#endif /* defined(SPI6) */


#endif /* ENABLE_SPI */
